Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.UnableToUpgradeAnalyticalElementGeometry
Unable to upgrade analytical element with incorrect geometry. To keep the elements, open Revit 2022 and correct the elements.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.LowestAssociatedLevelAboveHighestAssociatedLevel
The Lowest Associated Level is set above the Highest Associated Level

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.HighestAssociatedLevelBelowLowestAssociatedLevel
The Highest Associated Level is set below the Lowest Associated Level

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.ContextualAnalyticalModelModeNotEnabled
Contextual Analytical Model not enabled. File open was canceled.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.CannotSlantAnalyticalWallError
Cannot slant a wall with an Analytical Model.  Please disable the Analytical Model first.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalSurfaceCannotMoveByConnector
Cannot move analytical surface because it will disconnect the analytical nodes.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalSurfaceCannotMove
Cannot move analytical surface.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalPanelNotVisible
Analytical Panel is not visible in the current view.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalPanelNotPlanar
Analytical Panel is not planar.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalElementsInvalidAfterUpgrade
One or several analytical elements have become invalid during the upgrade process and will be deleted.

Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalCurvedPanelNotValid
Analytical Curved Panel is not valid.